import { gamenetI18n } from 'gamenet-material'
import React from 'react'

export const zh = {
  ...gamenetI18n.zh,
  poker99: '童話99',
  howToPlay: '玩法',
  howToPlayContent: (
    <div>
      <h3>操作說明</h3>
      <div>
        一開始每個人會分得五張牌,
        由電腦隨機決定第一個出牌者,
        之後每個玩家依順時鐘方向輪流出牌,
        每出一張牌會再分得一張牌,
        出牌後除了某些擁有特殊功能的牌之外,
        牌上的點數會累加到目前的 "累積分數",
        "累積分數" 最大只能到99~
      </div>
      <h3>出局條件</h3>
      <div>
        當輪到某位玩家出牌而該玩家沒有任何牌能使 "累積分數" 小於等於99, 則該玩家就會被判出局~
      </div>
      <h3>優勝條件</h3>
      <div>單局遊戲剩下最後一位沒出局的玩家即為優勝者!!</div>
      <h3>牌面規則</h3>
      <div>
        <ul>
          <li>1, 2, 3, 6, 7, 8, 9: "累積分數" 加上牌面點數</li>
          <li>4: 更改目前玩家輪流方向(如: 順時鐘-{'>'}逆時鐘)</li>
          <li>5: 指定某位玩家(自己除外)出牌</li>
          <li>10: "累積分數" 加或減10</li>
          <li>J: PASS, 跳過自己換下一個玩家</li>
          <li>Q: "累積分數" 加或減20</li>
          <li>K: "累積分數" 直接加到99</li>
          <li>黑桃1: "累積分數" 歸一</li>
        </ul>
      </div>
    </div>
  )
}
